{
  "education": [
    {
      "awards_achievements": [
        "Graduated with high honors",
        "GPA: 3.9/4.0"
      ],
      "degree": "Advanced Diploma",
      "department": "Software Engineering Technology - Artificial Intelligence",
      "duration": "2020-2022",
      "school_name": "Centennial College"
    },
    {
      "awards_achievements": [
        "GPA: 3.7/4.0"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Computer Engineering",
      "duration": "2015-2019",
      "school_name": "Gujarat Technological University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-keyursheladeeya",
  "highlighted_projects": [
    {
      "description": "I performed data preprocessing, feature engineering, and data modeling for classification by implementing a fine-tuned model using Python's Data Pipelines. Subsequently, I utilized Postman to predict the likelihood of a bicycle being stolen by deploying the trained model and providing new data for prediction.",
      "name": "Bicycle Theft Prediction with Supervised Learning"
    },
    {
      "description": "I developed an Artificial Neural Network (ANN) model using TensorFlow and Keras, leveraging real student data to predict their success level. Afterwards, I saved and integrated the trained model into a web application using Flask. For the front-end, I utilized Vue.js to create an interactive user interface.",
      "name": "Student Success Prediction with Neural Network"
    }
  ],
  "jarvis_projects": [
    {
      "description": "I created a Cluster Monitor Agent utilizing bash scripts, which enables users to monitor and save hardware specifications and usage data for multiple Linux systems. Once installed on each node, the monitoring agent automatically gathers hardware information and resource usage data from the server, storing it in a PostgreSQL database provisioned with Docker. Resource usage is obtained periodically using Crontab every minute, and the collected data can be manipulated through SQL queries. To ensure efficient code review and collaboration among team members, I implemented Git for version control and utilized GitHub as the central repository for the project, enabling effective code review and collaboration among team members.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Keyurkumar Sheladeeya",
  "others": [
    {
      "bullets": [
        "Android application development training (BrainyBeam Technologies Pvt. Ltd.: 2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "I have been actively involved as a cricket player, participating in various regional tournaments and achieved multiple awards for my accomplishments.",
        "Participated in 'Hackathon 5.0' organized by Rajasthan Government at Bikaner.",
        "Participated in 'TECHNOTHON 2K19' At Government Engineering College, Modasa.",
        "Participated in Various Technical Events in multiple colleges during my bachelors",
        "traveler"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "I am a member of a collaborative team at Jarvis Technologies, where we work together to design, develop, and implement software systems. My expertise in Python and Java allows me to write high-quality, efficient, and scalable code. I use advanced tools like Docker, Linux/Bash, Git, and GitHub to manage the software development process and ensure the reliability of the code. My main focus is on delivering software features that meet the requirements, and I always stay updated with the latest industry trends and best practices. I actively participate in Agile development processes, following the Scrum methodology to meet project deadlines and deliver high-quality software solutions.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Techy Panther",
      "description": "I was responsible for managing the backend portion of a small wedding project, including the development of APIs using the Django framework. I utilized PostgreSQL, an open-source relational database management system, to store and manage the project's data. Throughout the project, I gained experience in requirement gathering and error handling, which involved communicating with the client and collaborating with senior developers to ensure smooth execution.",
      "duration": "2019-2020",
      "title": "Junior Backend Developer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "Cloud Platforms",
      "REST APIs",
      "HTML/CSS",
      "Django/Flask"
    ],
    "familiar": [
      "Angular/React",
      "Spring Boot",
      "C/C++",
      "Node.js",
      "MongoDB"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitHub",
      "Python",
      "AI/ML"
    ]
  },
  "summary": "I have acquired an Advanced Diploma in Software Engineering Technology - Artificial Intelligence from Centennial College, along with a Bachelor of Technology degree in Computer Engineering from Gujarat Technological University. Currently employed as a Software Developer at Jarvis Technologies Group Inc., I apply my skills to create efficient and effective software systems. Throughout my Advanced Diploma program, I worked on various challenging AI projects, enabling me to gain hands-on experience with cutting-edge technologies. I have a strong passion for working with numbers and enjoy tackling technical challenges. Collaborating in a team environment is something I thrive on, and I have a keen interest in both data engineering and developer positions. I have a rapid learning ability and always strive to expand my knowledge and skill set. Being part of a successful software development team excites me, and I look forward to the challenges and rewards that come with it."
}
